# در این تمرین، شما باید یک تابع به نام is_greater(a, b) تعریف کنید که بررسی کند آیا عدد a بزرگ‌تر از b است یا خیر.

# وظیفه شما:
# یک تابع به نام is_greater(a, b) تعریف کنید که:

# دو عدد صحیح a و b را به عنوان ورودی دریافت کند.
# بررسی کند که آیا a از b بزرگ‌تر است یا نه.
# مقدار True را برگرداند اگر a > b باشد.
# مقدار False را برگرداند اگر a ≤ b باشد.
# مقدار باید برگردانده (return) شود و نه مستقیماً چاپ شود.
# ورودی‌ها:
# دو عدد صحیح a و b که از ورودی خوانده می‌شوند.
# خروجی‌ها:
# مقدار True اگر a بزرگ‌تر از b باشد.
# مقدار False اگر a کوچک‌تر یا مساوی b باشد.


# ورودی نمونه 1:

# 10
# 5

# خروجی مورد انتظار 1:

# True
 

# ورودی نمونه 2:

# 3
# 7

# خروجی مورد انتظار 2:

# False

# -----------------------------

def is_greater(a:int, b:int):
    return a > b

a = int(input("Enter First Number: "))
b = int(input("Enter Second Number: "))

is_greater(a,b)
