# یک فروشگاه تخفیف‌های ویژه‌ای برای مشتریان در نظر گرفته است. قوانین تخفیف به شرح زیر است:

# اگر مبلغ خرید بیشتر از ۵۰۰۰۰ تومان باشد، تخفیف ۲۰٪ اعمال می‌شود.
# اگر مبلغ خرید بین ۲۰۰۰۰ تا ۵۰۰۰۰ تومان باشد، تخفیف ۱۰٪ اعمال می‌شود.
# اگر مبلغ خرید کمتر از ۲۰۰۰۰ تومان باشد، تخفیفی اعمال نمی‌شود.

# برنامه‌ای بنویسید که مبلغ خرید را از کاربر دریافت کند و مقدار مبلغ نهایی را نمایش دهد.
# ورودی ۱:

# 55000


# خروجی ۱:

# 44000

# ----------------------------------------------------------------------------------------------------
print("Enter Your Total Price\a")
price = int(input())
print(f"You Entered This Price:{price}\n \a")
final = 0
discount = 0

if price >= 50000:
    final = price - ((price * 20)/100)
    discount = 20
elif 20000 < price < 50000:
    final = price - ((price * 10)/100)
    discount = 10
else:
    final = price



print("=======================================================\a")
print("=======================================================")
print(f'You have {discount} percent discount and your Final Price is:{final}')
print("=======================================================")
print("=======================================================")




