# بلندترین ساختمان در افق 
# شما باید یک تابع به نام skyline(*args) بنویسید که ارتفاع تعدادی ساختمان را دریافت کند و بلندترین ارتفاع را برگرداند.

# وظیفه شما:
# تابعی به نام skyline(*args) بنویسید که:تعدادی عدد صحیح (ارتفاع ساختمان‌ها) را به عنوان ورودی دریافت کند.
# بیشترین عدد را از بین آن‌ها پیدا کند و برگرداند.
# اگر هیچ عددی وارد نشد، مقدار 0 را برگرداند.

# ورودی‌ها:
# چندین عدد صحیح که نمایانگر ارتفاع ساختمان‌ها هستند.

# خروجی‌ها:
# یک عدد صحیح که بلندترین ساختمان را مشخص می‌کند.
# اگر هیچ مقداری داده نشود، مقدار 0 را برگرداند.

# ورودی نمونه 1:

# 3 7 15 2 9

# خروجی مورد انتظار 1:

# 15

# چون بلندترین ساختمان دارای ارتفاع 15 است.

# ورودی نمونه 2:

# 1 1 1 1

# خروجی مورد انتظار 2:

# 1

# چون تمام ساختمان‌ها هم ارتفاع هستند و مقدار ماکزیمم 1 است.

#------------------------------------------------------------------------

def skyline(*args):
    highest = 0
    for i in args:
        if i > highest:
            highest = i
    return highest

print(skyline(2,3,6,11,3))

