# تابعی به نام is_positive بنویسید که یک عدد دریافت کند و مقدار True را برگرداند اگر عدد مثبت یا صفر باشد، و در غیر این صورت مقدار False را برگرداند.

# ورودی‌ها:
# یک عدد صحیح (int).

# خروجی‌ها:
# مقدار True اگر مثبت و یا صفر باشد.
# مقدار False اگر منفی باشد.

# ورودی و خروجی نمونه:
# ورودی نمونه 1:

# 5

# خروجی مورد انتظار 1:

# True

# ورودی نمونه 2:

# -3

# خروجی مورد انتظار 2:

# False

#-------------------------------------------------

def is_private(number):
    return number >= 0

print("Enter Your Number to Check its Sign: ")
print(is_private(int(input())))
