# در این تمرین، شما باید یک تابع به نام pick_evens(*args) بنویسید که یک سری عدد دریافت کند و فقط اعداد زوج را برگرداند.

# وظیفه شما:
# تابعی به نام pick_evens(*args) بنویسید که:تعداد نامحدودی عدد به عنوان ورودی دریافت کند.
# فقط اعداد زوج را در قالب یک لیست برگرداند.
# اگر هیچ عدد زوجی وجود نداشت، لیست خالی [] را برگرداند.

# ورودی‌ها:
# چندین عدد صحیح که به تابع pick_evens ارسال می‌شوند.

# خروجی‌ها:
# یک لیست که شامل فقط اعداد زوج است.
# اگر هیچ عدد زوجی در ورودی نباشد، لیست خالی [] برگردانده شود.


# ورودی نمونه 1:

# 1 2 3 4 5 6

# خروجی مورد انتظار 1:

# [2, 4, 6]

# چون فقط اعداد زوج در لیست باقی می‌مانند.

# ورودی نمونه 2:

# 7 13 19 21

# خروجی مورد انتظار 2:

# []

# چون هیچ عدد زوجی وجود ندارد.

#--------------------------------------------


def pick_evens(*args):
    res = []
    for i in args:
        if i%2 == 0:
            res.append(i)
    return res

print(pick_evens(1,2,3,4))


