# در این تمرین، شما باید یک تابع بنویسید که دو عدد صحیح را دریافت کند و مجموع مربع‌های آن‌ها را محاسبه کند.

# وظیفه شما:
# تابعی به نام sum_of_squares بنویسید که دو عدد صحیح دریافت کند و مقدار مجموع مربع‌های آن دو عدد را برگرداند.

# فرمول محاسبه:

# sum_of_squares(a,b)=a**2+b**2

# ورودی‌ها:
# دو عدد صحیح (int).
# خروجی‌ها:
# یک عدد صحیح که مجموع مربع‌های دو عدد ورودی است.

# ورودی نمونه 1:

# 3
# 4

# خروجی مورد انتظار 1:

# 25

# (چون 32+42=9+16=25)

# ورودی نمونه 2:

# 5
# 12

# خروجی مورد انتظار 2:

# 169

# (چون 52+122=25+144=169)

#---------------------------------------------------

def sum_of_squares(a : int, b: int):
    '''
    sum_of_squares(a,b)=a**2+b**2
    '''
    return a*a + b*b

a = int(input("Enter Number a: "))
b = int(input("Enter Number b: "))

print(sum_of_squares(a,b))
