# یک ماشین به نام «ماشین جادویی» داریم که یک عدد اولیه n را می‌گیرد و می‌خواهد به 1 برسد. ماشین می‌تواند دو کار انجام دهد:

# اگر عدد فعلی بر ۲ بخش‌پذیر باشد، آن را نصف می‌کند.
# اگر عدد فعلی بر ۲ بخش‌پذیر نباشد، عدد را ضربدر ۳ کرده و ۱ را به آن اضافه می‌کند.
# وظیفه شما این است که برنامه‌ای بنویسید که عدد اولیه n را از ورودی دریافت کرده و نشان دهید که چگونه ماشین به 1 می‌رسد.

# ورودی:

# یک عدد صحیح n (۲ ≤ n ≤ ۱۰۰۰)

# خروجی:

# در هر مرحله، مقدار فعلی عدد n را چاپ کنید تا وقتی که عدد به ۱ برسد. 

 

# ورودی نمونه:

# 50

# خروجی نمونه:

# 50
# 25
# 76
# 38
# 19
# 58
# 29
# 88
# 44
# 22
# 11
# 34
# 17
# 52
# 26
# 13
# 40
# 20
# 10
# 5
# 16
# 8
# 4
# 2
# 1

# ---------------------------------------------------------------
# ---------------------------------------------------------------
# ---------------------------------------------------------------

print("Enter Number N: ( 2 <= n <= 1000) \a")

n = int(input())

while n != 1:
    if (n % 2 == 0):
        n = n/2
    else:
        n = (n * 3) + 1
    print(n)

print("Job Ended!!! \a")